### Q1 Series

In [ ]:
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2 Series

In [ ]:
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3 DataFrame

In [ ]:
      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

### Q4 Series Example

In [ ]:
0    100
1    200
2    300
Name: Example Series, dtype: int64

### Q4 DataFrame Example

In [ ]:
   Column1 Column2
0      100       A
1      200       B
2      300       C

### Q5 Head Example

In [ ]:
    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles

### Q7 DataFrame from Series

In [ ]:
    Fruit  Price
0   Apple    1.2
1  Banana    0.5
2  Cherry    0.3